[
	{
	"image": "https://th-i.thgim.com/public/incoming/h0d9m8/article67463410.ece/alternates/LANDSCAPE_1200/IMG_N_Biren_Singh_addres_2_1_42BPOEL5.jpg",
	"title": "Mobile internet ban in Manipur extended till October 31",
	"full_news": "The move comes barely a week after Chief Minister N Biren Singh had said the government would withdraw the ban within the next few days.The ban was extended following \"apprehensions that some anti-social elements might use social media extensively for transmission of images, hate speech and hate videos inciting the passions of the public which might have serious repercussions on the law and order situation\" a government notification said.The notification by commissioner (home) T Ranjit Singh informed that the DGP vide letter dated October 25 had reported that there are still reports of incidents of violence like confrontation of the public with security forces, attempts to mob elected members residences and civil protests in front of police stations.",
	"short_description": "The move comes barely a week after Chief Minister N Biren Singh had said the government would withdraw the ban within the next few days"
	},

	{
	"image": "https://th-i.thgim.com/public/incoming/85mhdv/article67463325.ece/alternates/LANDSCAPE_1200/PTI10_26_2023_000189B.jpg",
	"title": "INDIA leader to be chosen at opportune time: Lalu Prasad",
	"full_news": "Former Bihar Chief Minister Lalu Prasad on Thursday slammed the Bharatiya Janata Party (BJP), saying it is trying to create communal divide, and added that it would be wiped out in upcoming Lok Sabha election. The Rashtriya Janata Dal (RJD) supremo also alleged the BJP is a threat to the Constitution of India. Speaking of the leadership issue in 2024 Lok Sabha election, Mr. Prasad stressed that a leader would be selected at the opportune hour, while praising Congress leader Rahul Gandhi, as a flag-bearer of social justice. Mr. Prasad made these statements during a function organised at Sadaquat Ashram, intended at celebrating the birth anniversary of Sri Krishna Singh, the first Chief Minister of Bihar. The RJD supremo visited the State Congress headquarters, also housed within the Ashram premises, after a gap of nearly eight years; most of the senior Congress leaders were present including Bihar Pradesh Congress Committee president Akhilesh Prasad Singh. The former Chief Minister said that the winds that originate in Bihar will spread over the entire country and lead to a victory of the new alliance, referring to the Indian National Developmental, Inclusive Alliance (INDIA). “We will wipe out Narendra Modi, Amit Shah and the RSS [Rashtriya Swayamsevak Sangh] in the coming Lok Sabha election. The present government at the Centre would be dethroned and that’s the reason they are uneasy. That explains the raids being conducted against the Opposition. The Government at the Centre does not have any work except conducting raids. However, they will not gain anything rather things going out of their hands,” Mr. Prasad said. He further said that the country is passing through a phase of crisis, and the communal forces are standing before the nation creating hatred among the people who believe in Ram and Rahim. Slamming the government at Centre, he added that the Constitution is in danger and democracy is being attacked. He described that looking at the present scenario the political parties which were separated are now getting united and formed the alliance bloc INDIA. “We started the very first meeting of INDIA from Patna itself followed by Mumbai and Bangalore in which 23 political parties came at one platform. People have asked us who would lead INDIA. Let me say that we will select the leader easily at the right time and there would be no difficulty in the process. Soon we are going to organise a mega rally in Patna’s historic Gandhi Maidan under the motto of ‘BJP Hatao Desh Bachao’ [depose BJP, save country],“ Mr. Prasad said. Talking about the upcoming assembly election in Rajasthan, Madhya Pradesh, Mizoram, Chhattisgarh and Telangana, Mr. Prasad expressed confidence that the BJP would lose all five states. Without naming anyone, Mr. Prasad alleged that the BJP-led National Democratic Alliance formed the government at Centre after cheating the people of India. He accused Prime Minister Narendra Modi of making false promises to bring back the money stashed in foreign accounts. “They promised to give ₹15 lakh to every Indian from the hidden money in foreign banks but later they said that there is no money in foreign accounts. This is the biggest betrayal of the people. This time we all have to ensure that they are defeated in the coming polls,” Mr. Prasad said. He did not miss the opportunity to attack the BJP over a recently released caste based survey report. The former Bihar CM claimed that one RSS worker (who remained unnamed) said that the BJP would lose all the seats in Bihar with the exception of the Patna Sahib seat. “After the caste based survey report, BJP leaders are feeling uneasiness. Even Rahul Gandhi had said that caste census would be done in the country if Congress party returns to power. Rahul Gandhi is the leader who raised the flag of social justice. They [BJP] want more shares in the power despite having 1% population. Now the power of the country would be distributed according to the population and social justice,“ Mr. Prasad said.  Many senior Congress leaders were present on the dais which includes Rajya Sabha MP Pramod Tiwari, former MP Tariq Anwar, former governor Nikhil Kumar, Anil Sharma, Congress Legislative Party (CLP) leader Shakeel Ahmad Khan and others.  On a lighter note, Mr. Prasad said that it was him, who sent Akhilesh Prasad Singh to Rajya Sabha. “I was in Ranchi jail when Akhilesh came to meet me. He wanted someone else to go to Rajya Sabha but I asked him to instead. I called Sonia Gandhiji and Ahmed Patel from the jail premises, and asked them to declare his name as Rajya Sabha nominee,” Mr. Prasad said. Interestingly, during his entire speech, Mr. Prasad did not once refer to Chief Minister Nitish Kumar who initiated the Opposition’s unity and conducted caste based survey in Bihar. ",
	"short_description": "The former Bihar Chief Minister called Rahul Gandhi a bearer of the ‘flag of social justice’ for his support toward a national caste census"
	},

	{
	"image": "https://th-i.thgim.com/public/incoming/dsc9n3/article67464963.ece/alternates/LANDSCAPE_1200/PTI10_27_2023_000015A.jpg",
	"title": "Cross-border firing stops along IB in Jammu, border dwellers start returning home",
	"full_news": "The intermittent exchange of fire between Pakistani Rangers and BSF personnel along the International Border in Arnia and RS Pura sectors of Jammu district ended early on October 27, officials said. Scores of families that had fled the border hamlets overnight after the unprovoked firing by Pakistani Rangers have now started returning to their homes. A Border Security Force (BSF) jawan and a civilian were injured in the cross-border firing targeting five Indian posts along the International Border (IB) on October 26 night. The BSF had effectively retaliated to the firing. \"The firing has stopped (from across the border). There is calm now\", a senior BSF officer told PTI. He said the intermittent exchange of fire between the two sides continued till 3 a.m. The official said two BSF personnel and a woman were injured on October 26 night and have been hospitalised. One jawan has been shifted to the GMC Hospital in Jammu. They have been identified as Basavraj S.R., who hails from Karnataka, and Sher Singh. The woman has been identified as Rajni Bala of Arnia. Pakistan Rangers had fired 82 and 120 mm mortar shells and used heavy machines guns, triggering fear among the border dwellers. Several people in Arnia, Treva, Suchetgarh and Jabowal, particularly migrant labourers, had left the border hamlets on October 26 night when the unprovoked firing started. Several families had taken shelter in bunkers, temples and other safe areas in the border area. People of border villages said they witnessed such intense firing and shelling after many years. \"We were eating food when the firing began. We left the food and ran along with our families,\" Joginder Kumar, a labourer from Bihar, said. Mr. Kumar, who along with 51 others, including women and children, had taken shelter in a temple in Arnia after leaving a forward village due to shelling, said they were terrified. \"We had heard about it (firing). Now we have seen it\", he said. In a forward hamlet where a mortar shell hit a house, Ekta Devi said, \"By God's grace, we were saved. There was a lot of firing till this morning. All glass windows broke\". Another villager Rakesh Kumar, who along with several villagers had taken shelter in a bunker in forward village, said they are now returning to their village. \"There was intense firing and shelling after many years. There was peace for the past two years. Pakistan cannot be trusted\", he said. Many videos went viral on social media which showed people fleeing their dwellings when the firing started. In Arnia, many guests fled from a wedding ceremony when the firing started. We continued with the marriage. Most of the people left after the firing started, Kuldeep, a relative of the bridegroom said. This is the second ceasefire violation in October. On October 19, two BSF jawans were injured in firing by Pakistan Rangers at the Vikram post along the IB in Arnia sector. India and Pakistan had signed a ceasefire agreement on February 25, 2021, in which both nations agreed to strictly observe all agreements on ceasefire along the Line of Control (LoC) in Jammu and Kashmir and other sectors.",
	"short_description": "A BSF jawan and a civilian were injured in the cross-border firing targeting five Indian posts along the IB on October 26 night"
	},

	{
	"image": "https://th-i.thgim.com/public/news/national/htfzet/article67464774.ece/alternates/LANDSCAPE_1200/WhatsApp%20Image%202023-10-27%20at%2010.08.23%20AM.jpeg",
	"title": "India will have the most tech-savvy police force, says Amit Shah at IPS passing out parade in Hyderabad",
	"full_news": "India will have the most tech-savvy police force to tackle cyber-threats and criminals, said Union Home Minister Amit Shah after reviewing the passing-out parade of the 75th batch of Indian Police Service (IPS) probationers at Sardar Vallabhbhai Patel National Police Academy (SVPNPA) in Telangana’s Hyderabad on Friday. “Technology will play an important role in the future and we are implementing a police technology mission with an aim to have the most tech savvy system in the world to tackle cyber threats and criminals. I’m sure the technological background of the officers will contribute to this initiative,” added the Union Minister. ",
	"short_description": "Union Home Minister Amit Shah was speaking at the Passing Out parade of IPS cadets at the Sardar Vallabhbhai Patel National Police Academy in Hyderabad."
	},

	{
	"image": "https://th-i.thgim.com/public/incoming/pk74d3/article67462134.ece/alternates/LANDSCAPE_1200/1756118907.jpg",
	"title": "Journal editor’s firing could negatively impact freedom of speech",
	"full_news": "The dismissal of journal editor Michael Eisen, fired for sarcastic tweets on the Israel-Palestine conflict, will have a chilling effect on academics and researchers which would affect much needed reform as well as scientific integrity  On October 24, Michael Eisen was fired as the Editor-in-Chief of the prominent open access journal eLife. Taking to X (formerly Twitter) Professor Eisen said he was fired by the journal for “retweeting” on October 14 a satirical article published in The Onion that criticised dying Palestinians for not condemning the October 7 attacks on Israel by Hamas. His quote tweet said: “The Onion speaks with more courage, insight and moral clarity than the leaders of every academic institution put together. I wish there were a @TheOnion university”.",
	"short_description": "The dismissal of journal editor Michael Eisen, fired for sarcastic tweets on the Israel-Palestine conflict, will have a chilling effect on academics and researchers which would affect much needed reform as well as scientific integrity "
	},

	{
	"image": "https://th-i.thgim.com/public/news/national/inok8w/article67462012.ece/alternates/LANDSCAPE_1200/apurva%20chandra.jpeg",
	"title": "‘Rath Prabharis’ now called nodal officers for outreach events",
	"full_news": "Following a controversy over the deployment of civil servants as “Rath Prabharis” during the coming Viksit Bharat Sankalp Yatra programme across the country, the government on Thursday clarified that the use of such a term was not proper and that the officials would instead be addressed as nodal officers. The Congress had raised an objection, asking how the officials could be told to do such a pre-poll “political propaganda” for the government. Through an October 17 letter, all the departments were earlier told that Joint Secretaries, Directors, and Deputy Secretaries would be deployed as “Rath Prabharis” to coordinate for the preparations, planning, execution and monitoring of the programme.",
	"short_description": "Information and Broadcasting Secretary Apurva Chandra said the programme would not be launched in the poll-bound States"
	},

	{
	"image": "https://th-i.thgim.com/public/incoming/h5j2eu/article67461093.ece/alternates/FREE_1200/IMG_DK_Shivakumar_at_ED__2_1_MRBCD1P9.jpg",
	"title": "ED summons Rajasthan CM Ashok Gehlot’s son in FEMA case",
	"full_news": "The Enforcement Directorate (ED) on October 26 summoned Chief Minister Ashok Gehlot’s son Vaibhav Gehlot in a foreign exchange violation case. Mr. Vaibhav Gehlot has been asked to depose before the federal agency’s headquarters in New Delhi on October 27, the sources said.",
	"short_description": "The summons is linked to the recent ED raids against Rajasthan-based hospitality group Triton Hotels & Resorts Pvt. Ltd., Vardha Enterprises Pvt. Ltd. and its directors and promoters"
	},

	{
	"image": "https://th-i.thgim.com/public/latest-news/k258gi/article67463212.ece/alternates/LANDSCAPE_1200/MachhalSector.jpg",
	"title": "Five militants killed near LoC in Kupwara: police",
	"full_news": "Five militants killed in a counter-infiltration operation near the Line of Control (LoC) in north Kashmir’s Kupwara on Thursday. A police spokesperson said an encounter with infiltrators started in the Machhal Sector, in which five terrorists were killed. ",
	"short_description": "Encounter with infiltrators started in the Machhal Sector, a police spokesperson says; Pakistan Rangers and BSF troops exchange fire in the Jammu’s Arnia Sector"
	},

	{
	"image": "https://www.hindustantimes.com/ht-img/img/2023/10/27/550x309/PTI10-27-2023-000016B-0_1698386491884_1698386522566.jpg",
	"title": "Akash Ambani praises PM Modi for 'always working on latest technology'",
	"full_news": "Chairman of Reliance Jio Infocomm Limited Akash Ambani on Friday praised Prime Minister Narendra Modi during the seventh edition of the India Mobile Congress for ‘leading the digital connectivity revolution to connect 1.4 billion Indians’ and for ‘always working on latest technology’. Every generation needs a vision that inspires it to do great things. You (PM Modi) have given my generation an aspirational vision to transform our country into 'Viksit Bharat' (developed India), Akash Ambani said while addressing the congregation at Delhi's Pragati Maidan, a venue that also hosted September's G20 Summit. At the event, the Reliance Jio Infocomm Limited introduced India's first satellite-based giga fibre service called JioSpaceFiber which will enable users to access high-speed bradband services. This technology was previously inaccessible to India. Akash Ambani showcased PM Modi the indigenous technology and products of Jio during the Mobie Congress event. “Jio have enabled millions of homes and businesses in india to experience broadband internet for the first time. With JioSpaceFiber, we expand our reach to cover the millions yet to be connected,” he said. According to the company, the one-of-its-kind satellite-based internet service will be available across the country at highly-affordable price. Meanwhile, the Prime Minister also inaugurated 100 5G labs, which include most of the well-known engineering colleges across the country. With a clear focus on the expansion of 5G, preparations for the forthcoming 6G, broadcasting, drone device manufacturing, semiconductor production, and sustainable technology, the event is poised to explore the cutting edge of technological progress, according to a government release. Artificial intelligence is also going to be among key themes in the event. Over 1,300 delegates and 400 speakers from 31 countries will join the gathering, turning it into a worldwide tech spectacle.",
	"short_description": "Akash Ambani was addressing the seventh edition of the India Mobile Congress in Delhi."
	},

	{
	"image": "https://www.hindustantimes.com/ht-img/img/2023/10/27/550x309/IMC_1698382805796_1698382810914.png",
	"title": "‘India's startup ecosystem among top 3 today’: PM Modi at India Mobile Congress",
	"full_news": "Prime Minister Narendra Modi on Friday opened the seventh edition of the India Mobile Congress (IWC), a three-day event being held at the Bharat Mandapam convention centre in Delhi's Pragati Maidan, a venue that also hosted September's G20 Summit. The prime minister also inaugurated 100 5G labs, which include most of the well-known engineering colleges across the country. In his speech, the PM noted that the ‘future is no longer a decade or a century away, but due to advances in technology, the future is here and now.’ He added that in nine years of his government, India's startup ecosystem has become one of the largest in the world, and is in the top 3. Today, the country has more than one lakh startups, Modi said. Recalling the launch of 5G technology in the country – the PM launched it on October 1 last year – he remarked how, within just a year, there are about 5 lakh 5G base stations across the nation . Speaking at the event, IT minister Ashwini Vaishnaw described telecom as the 'gateway' to Digital India, adding that today, the country exports telecom equipment to more than 70 nations. The minister further noted that the next edition of the World Telecommunications Standardisation Assembly will be held in the national capital. Other eminent personalities who spoke at the event were Akash Ambani (Chairperson, Reliance Jio), Sunil Bharti Mittal (Chairperson, Bharti Enterprises) and Kumar Mangalam Birla (Chairperson, Aditya Birla Group).",
	"short_description": "The 3-day IWC is taking place at the Bharat Mandapam convention centre in Delhi's Pragati Maidan. The venue also hosted September's G20 Summit."
	},

    {
    "image": "https://th-i.thgim.com/public/incoming/vo72rl/article67472591.ece/alternates/LANDSCAPE_1200/20231028178L.jpg",
    "title": "PM reiterates ‘Vocal for Local’ pitch",
    "full_news": "Ahead of Deepavali celebrations, Prime Minister Narendra Modi on Sunday urged Indians to promote the “Vocal for Local” campaign and buy indigenous products in order to achieve the dream of Aatmnirbhar Bharat, or a self-sufficient India. During his monthly Mann Ki Baat address, Mr. Modi said that the ongoing Khadi Mahotsav had broken all its previous sales records. While sales had barely touched ₹30,000 crore in previous years, sales in this edition were about to reach ₹1.25 lakh crore, he said.",
    "short_description": "During the ongoing Khadi Mahotsav, sales have almost reached ₹1.25 lakh crore, breaking all previous records, the PM said in this month’s Mann ki Baat"
    },

    {
    "image": "https://th-i.thgim.com/public/incoming/3vt1ea/article67473910.ece/alternates/LANDSCAPE_1200/PHILIP_GREEN_AUSTRALIA_2023_26_10_12.jpg",
    "title": "Canada-India rift is ‘painful’ for common friend Australia, hope it is resolved soon: Australian High Commissioner to India",
    "full_news": "The rift between Canada and India is “painful” for Australia that has good ties with both, but will not affect bilateral ties, Australian High Commissioner to India Phillip Green said. He said the conversations between Indian and Australian officials over the issue would “stay” between the diplomats. In an interview to The Hindu, Mr. Green, who took over as Australia’s Ambassador in August, confirmed that Prime Minister Anthony Albanese, who travelled to India twice this year, was looking forward to return to Delhi next year for the Quad summit due to be held around January 26. He did not, however, confirm the date for the summit, saying that is for India to announce. “Canada is an old friend of Australia’s and India is a dear friend and a country of considerable importance to us,” the Australian High Commissioner said, likening the India-Canada tussle sparked by the killing of Khalistani separatist Nijjar in Surrey in Canada, and the expulsion of diplomats to a dilemma between personal friends. “It’s painful, and it’s difficult. We hope and we trust that some new foothold can be made in the bilateral relationship and they can work through these difficulties as soon as possible,” he added. ",
    "short_description": "Australian envoy says Prime Minister Anthony Albanese looks forward to returning to India for the Quad summit in 2024"
    },

    {
    "image": "https://th-i.thgim.com/public/incoming/3qd7n/article67472711.ece/alternates/LANDSCAPE_1200/20231028025L.jpg",
    "title": "Two China-made drones recovered near International Border in Punjab's Amritsar, Tarn Taran",
    "full_news": "Two drones were recovered in two separate incidents near the International Border in Punjab's Amritsar and Tarn Taran districts, a BSF official said. On the basis of specific information, a search operation was conducted by the Border Security Force near Daoke village in Amritsar on Sunday (October 29).",
    "short_description": "On Saturday evening, another drone was recovered by the BSF in a joint operation with the Punjab Police in Dholan village in Tarn Taran"
    },

    {
    "image": "https://th-i.thgim.com/public/todays-paper/tp-national/whhtb4/article66434215.ece/alternates/LANDSCAPE_1200/Th25-Kallol-Ind%2BG32APUMBH.3.jpg.jpg",
    "title": "PM Modi discusses humanitarian assistance with Egypt’s El-Sisi as Israel attacks Gaza",
    "full_news": "Prime Minister Narendra during the weekend spoke with Egyptian President Abdel Fattah El-Sisi to discuss the latest in the Israel-Palestine conflict which reached a critical stage with Israeli forces rolling into the north Gaza during late Saturday. The discussion indicated fast moving international exchanges among the key stakeholders as Prime Minister Benyanmin Netanyahu asserted that Israel will fight a “long and difficult” war against Hamas in Gaza. ",
    "short_description": "After his telephonic conversation with Mr. Sisi, PM Modi said that \"we share concerns regarding terrorism, violence and loss of civilian lives\""
    },

    {
    "image": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202310/train-derailed-visakhapatnam-295329526-16x9_0.jpeg?VersionId=c4wPSLs0RPr2xYqhsrWSQjMwD3TJet7g&size=690:388",
    "title": "3 dead, over 40 injured as train derails in Andhra's Vizianagaram district",
    "full_news": "Three passengers were killed and over 40 injured after a collision between two trains resulted in the derailment in Andhra Pradesh's Vizianagaram district on Sunday. The 08504 Visakhapatnam-Rayagada Passenger train collided with the 08532 Visakhapatnam-Palasa Passenger train. The collision led to the derailment of three coaches of the Visakhapatnam-Rayagada train, according to railway officials. \"Bogies derailed after a train travelling along with passengers from Vizianagaram to Raigad hit a passenger train travelling on the same route from Visakapatnam to Palasa,\" East Central Railway CPRO said. \"Injuries reported but figures yet to be known. Two trains were involved in the accident. The rescue and restoration process is on,\" the railway official added. Reacting to the accident, Chief Minister YS Jagan Mohan Reddy issued orders to take immediate relief measures and to send as many ambulances as possible from Visakhapatnam and the nearest districts of Vizianagaram to the scene. All kinds of arrangements in nearby hospitals need to be made to provide good medical care for the injured. The Chief Minister further ordered the railway authorities to coordinate with other government departments, including health, police and revenue to take quick-relief measures and ensure that the injured receive prompt medical services. This incident comes months after massive accident was caused after the Coromandel Express crashed into a stationary freight train at Bahanaga Bazar station in Balasore on June 2. At least 288 people were killed and over 1,100 people were injured in the accident.",
    "short_description": "A passenger train, going from Visakhapatnam to Rayagada, collided with another train, Palasa Express, en route to Visakhapatnam on Sunday."
    },

    {
    "image": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202310/manoj-jarange-293356895-16x9_0.jpg?VersionId=1UcTTlGbM3DkUyYK2FntuPk11WIGLpR5&size=690:388",
    "title": "Come for discussion: Maratha quota activist to government amid weakening health",
    "full_news": "Maratha reservation activist Manoj Jarange Patil on Sunday urged the Maharashtra government to come for a discussion to deliberate on the demands. Jarange has been demanding that the Maratha community should be granted reservation in government jobs and education under the Other Backward Classes (OBC) category. The demand for discussions with the government came amid his second indefinite hunger strike which he started on Wednesday, after a 40-day deadline which ended on October 24. “Come for discussion; the Marathas will not stop you anywhere. As long as I can speak, come to the discussion. There is no use of coming later. Just tell me whether it will be discussed once or not,\" Jarange said. “The government (Maharashtra government) has no answer or communication. We will wait until October 30-31. The government does not understand humanity. We will answer them (after that),” Jarange said, holding a microphone with his shaky hands, as he spoke to the media on Sunday. According to doctors, his medical condition has deteriorated due to the hunger strike. Meanwhile, the state’s Deputy Chief Minister Devendra Fadnavis responded to his demand and said, \"discussion cannot be done in front of the media cameras.\" He also appealed to the followers of Patil to take care of him and assured them that the government is looking into the issue. \"People with Manoj Jarange also need to take some care of him. Chief Minister Eknath Shinde himself is looking into it. Efforts are being made through the Chief Minister to ensure that whatever is the right decision should be taken. Therefore, they should trust Chief Minister Eknath Shinde,\" Fadnavis said.",
    "short_description": "Manoj Jarange Patil, the face of the Maratha quota protest, has restarted his hunger strike after a 40-day deadline given by him to the government."
    }
]


